# Bonus-Analysis

### Import Dependencies and SQL Database

In [4]:
# Import Dependencies
import pandas as pd
import matplotlib.pyplot as plt
import sqlalchemy
import psycopg2

from sqlalchemy import create_engine
from config import username
from config import password

In [5]:
# Connect to localhost database:
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/hp_employees')
connection = engine.connect()

In [6]:
# Confirm the tables from SQL Database
engine.table_names()

['employees', 'dept_emp', 'departments', 'dept_manager', 'titles', 'salaries']

## Data Retrieval

### Import all database tables

In [8]:
# Read in employees database
employees_df = pd.read_sql("SELECT * FROM employees", connection, parse_dates=['birth_date', 'hire_date'])
employees_df.head()

   emp_no emp_title_id birth_date  first_name  last_name sex  hire_date
0  473302        s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053        e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444        e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786        s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238        e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

In [9]:
# Read in dept_emp database
dept_emp_df = pd.read_sql("SELECT * FROM dept_emp", connection)
dept_emp_df.head()

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004
3   10004    d004
4   10005    d003

In [10]:
# Read in departments database
departments_df = pd.read_sql("SELECT * FROM departments", connection)
departments_df.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

In [ ]:
# Read in dept_manager database
dept_mana_df = pd.read_sql("SELECT * FROM dept_emp", connection)
dept_emp_df.head()